In [1]:
import numpy as np
import pandas as pd

In [13]:
data = [["Hargrave", 619, "France", 42, "yes"],
        ["Hill", 608, "Spain", 41, "no"],
        ["Onio", 502, "France", np.nan, "yes"],
        ["Boni", 699, "France", 39, "no"],
        ["Mitchell", 850, "Spain", 43, "no"],
        ["Chu", np.nan, "Spain", 44, "yes"]]

df = pd.DataFrame(data=data, 
                  columns=["surname", "credit_score", "geography", "age", "exited"])
print(df.isna().sum())
df

surname         0
credit_score    1
geography       0
age             1
exited          0
dtype: int64

    surname  credit_score geography   age exited
0  Hargrave         619.0    France  42.0    yes
1      Hill         608.0     Spain  41.0     no
2      Onio         502.0    France   NaN    yes
3      Boni         699.0    France  39.0     no
4  Mitchell         850.0     Spain  43.0     no
5       Chu           NaN     Spain  44.0    yes

In [11]:
# remove missing values
# drop the rows with NaN
df1 = df.dropna(axis=0)
print(df1)

# drop the columns with NaN
df2 = df.dropna(axis=1)
print(df2)

# Count the number of remaining missing values
df1.isna().sum()

    surname  credit_score geography   age exited
0  Hargrave         619.0    France  42.0    yes
1      Hill         608.0     Spain  41.0     no
3      Boni         699.0    France  39.0     no
4  Mitchell         850.0     Spain  43.0     no
    surname geography exited
0  Hargrave    France    yes
1      Hill     Spain     no
2      Onio    France    yes
3      Boni    France     no
4  Mitchell     Spain     no
5       Chu     Spain    yes

surname         0
credit_score    0
geography       0
age             0
exited          0
dtype: int64

In [20]:
df[df["geography"] == "France"]["credit_score"].mean()

606.6666666666666

In [22]:
# Reshape the dataframe - only keep the credit scores
df_new = pd.pivot_table(df, index=["geography"], columns=["exited"], values="credit_score", aggfunc=np.mean)
df_new

exited        no    yes
geography
France     699.0  560.5
Spain      729.0    NaN

In [28]:
df_new.mean(axis='index')

exited
no     714.0
yes    560.5
dtype: float64

In [37]:
print(df)
new_df = df.dropna(subset=["age"])
new_df

    surname  credit_score geography   age exited
0  Hargrave         619.0    France  42.0    yes
1      Hill         608.0     Spain  41.0     no
2      Onio         502.0    France   NaN    yes
3      Boni         699.0    France  39.0     no
4  Mitchell         850.0     Spain  43.0     no
5       Chu           NaN     Spain  44.0    yes

    surname  credit_score geography   age exited
0  Hargrave         619.0    France  42.0    yes
1      Hill         608.0     Spain  41.0     no
3      Boni         699.0    France  39.0     no
4  Mitchell         850.0     Spain  43.0     no
5       Chu           NaN     Spain  44.0    yes

In [41]:
print(df.sort_values("age", axis=0))
new_df.sort_values("age")

    surname  credit_score geography   age exited
3      Boni         699.0    France  39.0     no
1      Hill         608.0     Spain  41.0     no
0  Hargrave         619.0    France  42.0    yes
4  Mitchell         850.0     Spain  43.0     no
5       Chu           NaN     Spain  44.0    yes
2      Onio         502.0    France   NaN    yes

    surname  credit_score geography   age exited
3      Boni         699.0    France  39.0     no
1      Hill         608.0     Spain  41.0     no
0  Hargrave         619.0    France  42.0    yes
4  Mitchell         850.0     Spain  43.0     no
5       Chu           NaN     Spain  44.0    yes